### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_key_vault_secret.ioweb_kv_audit_st_connection_string will be created
  + resource "azurerm_key_vault_secret" "ioweb_kv_audit_st_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ioweb-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ioweb-kv-01"
      + name                    = "ioweb-kv-audit-st-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.function_web_profile.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                                                                  = "5"
          - "AUDIT_LOG_CONNECTION_STRING"                                                                      = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-ioweb-kv-01.vault.azure.net/secrets/spid-logs-st-connection-string)"
          - "AUDIT_LOG_CONTAINER"                                                                              = "auditlogs"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage" = "5"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage"     = "5"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage"     = "5"
          - "BEARER_AUTH_HEADER"                                                                               = "authorization"
          - "BETA_TESTERS"                                                                                     = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-ioweb-kv-01.vault.azure.net/secrets/ioweb-profile-api-beta-testers)"
          - "EXCHANGE_JWT_ISSUER"                                                                              = "api-web.io.pagopa.it/ioweb/backend"
          - "EXCHANGE_JWT_PRIMARY_PRIVATE_KEY"                                                                 = (sensitive value)
          - "EXCHANGE_JWT_PRIMARY_PUB_KEY"                                                                     = (sensitive value)
          - "EXCHANGE_JWT_TTL"                                                                                 = "3600"
          - "FAST_LOGIN_API_KEY"                                                                               = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-ioweb-kv-01.vault.azure.net/secrets/ioweb-profile-functions-fast-login-api-key)"
          - "FAST_LOGIN_CLIENT_BASE_URL"                                                                       = "https://io-p-itn-auth-lv-func-02.azurewebsites.net"
          - "FETCH_KEEPALIVE_ENABLED"                                                                          = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                                                              = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                                                                 = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                                                                      = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                                                                = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                                                                          = "60000"
          - "FF_API_ENABLED"                                                                                   = "ALL"
          - "FUNCTIONS_APP_API_KEY"                                                                            = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-ioweb-kv-01.vault.azure.net/secrets/ioweb-profile-functions-app-api-key)"
          - "FUNCTIONS_APP_CLIENT_BASE_URL"                                                                    = "https://io-p-itn-auth-profile-func-02.azurewebsites.net"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                                                                   = "2"
          - "HUB_SPID_LOGIN_API_KEY"                                                                           = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-ioweb-kv-01.vault.azure.net/secrets/ioweb-profile-spid-login-api-key)"
          - "HUB_SPID_LOGIN_CLIENT_BASE_URL"                                                                   = "https://io-p-weu-ioweb-spid-login.azurewebsites.net"
          - "HUB_SPID_LOGIN_JWT_ISSUER"                                                                        = "api-web.io.pagopa.it/ioweb/auth"
          - "HUB_SPID_LOGIN_JWT_PUB_KEY"                                                                       = (sensitive value)
          - "MAGIC_LINK_BASE_URL"                                                                              = "https://account.ioapp.it/it/blocco-accesso/magic-link/"
          - "MAGIC_LINK_JWE_ISSUER"                                                                            = "api-web.io.pagopa.it/ioweb/backend"
          - "MAGIC_LINK_JWE_PRIMARY_PRIVATE_KEY"                                                               = (sensitive value)
          - "MAGIC_LINK_JWE_PRIMARY_PUB_KEY"                                                                   = (sensitive value)
          - "MAGIC_LINK_JWE_TTL"                                                                               = "604800"
          - "NODE_ENV"                                                                                         = "production"
          - "SLOT_TASK_HUBNAME"                                                                                = "ProductionTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"                                                  = "1"
          - "WEBSITE_DNS_SERVER"                                                                               = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                                                                         = "1"
          - "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/api/v1/info"
          - "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          - "WEBSITE_WARMUP_PATH"                                                                              = "/api/v1/info"
        } -> (known after apply)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01"
        name                                           = "io-p-itn-auth-webprof-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (33 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
                "SLOT_TASK_HUBNAME",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_web_profile.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                                                                  = "100"
          - "AUDIT_LOG_CONNECTION_STRING"                                                                      = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/audit-st-connection-string)"
          - "AUDIT_LOG_CONTAINER"                                                                              = "ioweb-auditlogs-01"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage" = "100"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage"     = "100"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage"     = "100"
          - "AzureFunctionsWebHost__hostid"                                                                    = "staging"
          - "BEARER_AUTH_HEADER"                                                                               = "authorization"
          - "BETA_TESTERS"                                                                                     = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-ioweb-kv-01.vault.azure.net/secrets/ioweb-profile-api-beta-testers)"
          - "EXCHANGE_JWT_ISSUER"                                                                              = "api-web.io.pagopa.it/ioweb/backend"
          - "EXCHANGE_JWT_PRIMARY_PRIVATE_KEY"                                                                 = (sensitive value)
          - "EXCHANGE_JWT_PRIMARY_PUB_KEY"                                                                     = (sensitive value)
          - "EXCHANGE_JWT_TTL"                                                                                 = "3600"
          - "FAST_LOGIN_API_KEY"                                                                               = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-ioweb-kv-01.vault.azure.net/secrets/ioweb-profile-functions-fast-login-api-key)"
          - "FAST_LOGIN_CLIENT_BASE_URL"                                                                       = "https://io-p-itn-auth-lv-func-02.azurewebsites.net"
          - "FETCH_KEEPALIVE_ENABLED"                                                                          = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                                                              = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                                                                 = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                                                                      = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                                                                = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                                                                          = "60000"
          - "FF_API_ENABLED"                                                                                   = "ALL"
          - "FUNCTIONS_APP_API_KEY"                                                                            = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-ioweb-kv-01.vault.azure.net/secrets/ioweb-profile-functions-app-api-key)"
          - "FUNCTIONS_APP_CLIENT_BASE_URL"                                                                    = "https://io-p-itn-auth-profile-func-02.azurewebsites.net"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                                                                   = "2"
          - "HUB_SPID_LOGIN_API_KEY"                                                                           = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-ioweb-kv-01.vault.azure.net/secrets/ioweb-profile-spid-login-api-key)"
          - "HUB_SPID_LOGIN_CLIENT_BASE_URL"                                                                   = "https://io-p-weu-ioweb-spid-login.azurewebsites.net"
          - "HUB_SPID_LOGIN_JWT_ISSUER"                                                                        = "api-web.io.pagopa.it/ioweb/auth"
          - "HUB_SPID_LOGIN_JWT_PUB_KEY"                                                                       = (sensitive value)
          - "MAGIC_LINK_BASE_URL"                                                                              = "https://account.ioapp.it/it/blocco-accesso/magic-link/"
          - "MAGIC_LINK_JWE_ISSUER"                                                                            = "api-web.io.pagopa.it/ioweb/backend"
          - "MAGIC_LINK_JWE_PRIMARY_PRIVATE_KEY"                                                               = (sensitive value)
          - "MAGIC_LINK_JWE_PRIMARY_PUB_KEY"                                                                   = (sensitive value)
          - "MAGIC_LINK_JWE_TTL"                                                                               = "604800"
          - "NODE_ENV"                                                                                         = "production"
          - "SLOT_TASK_HUBNAME"                                                                                = "StagingTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"                                                  = "1"
          - "WEBSITE_DNS_SERVER"                                                                               = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                                                                         = "1"
          - "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/api/v1/info"
          - "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          - "WEBSITE_WARMUP_PATH"                                                                              = "/api/v1/info"
        } -> (known after apply)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>
